---
type: ParameterMap
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ParameterMap

`Autodesk.Revit.DB.ParameterMap` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ParameterMap | — | `public ParameterMap ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( string key )` |
| Method | Erase | — | `public virtual int Erase ( string key )` |
| Method | ForwardIterator | — | `public virtual ParameterMapIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( string key , Parameter item )` |
| Method | ReverseIterator | — | `public virtual ParameterMapIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Parameter this [ string key ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |